In [24]:
import pandas as pd 
import numpy as  np
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n
import math
%matplotlib inline

In [25]:
hire = pd.read_csv('hiring.csv')
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
hire.experience = hire.experience.fillna('zero')

In [27]:
hire.experience = hire.experience.apply(w2n.word_to_num)

In [28]:
hire

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [30]:
test_score_median = math.floor(hire['test_score(out of 10)'].median())

In [34]:
hire['test_score(out of 10)'] = hire['test_score(out of 10)'].fillna(test_score_median)

In [37]:
hire

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [39]:
reg = linear_model.LinearRegression()
reg.fit(hire[['experience','test_score(out of 10)','interview_score(out of 10)']],hire['salary($)'])

LinearRegression()

In [40]:
reg.predict([[2,9,6]])

/home/opeyemi/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])